"""
Создает словари раскладок клавиатуры с символами для разных комбинаций клавиш.
Функция возвращает два словаря раскладок:
1. `keylout_shift` - словарь символов при нажатии клавиш с клавишей Shift.
2. `keylout_dd` - словарь для символьной раскладки "ицукен" и "вызов",
где первая скобка для раскладки "ицукен", а вторая скобка для "вызов".

Ключи словарей соответствуют пальцам рук:
- 'lfi5' обозначает левый мизинец, 'lfi4' - левый безымянный, и так далее.
- 'rfi5' - правый мизинец, 'rfi4' - правый безымянный и т.д.
"""

keylout_shift = {
    'lfi5': [('~', '!'), ('$','%')],
    'lfi4': [('@'), ('7')],
    'lfi3': [('#'), ('5')],
    'lfi2': [('$', '%'), ('3','1')],
    'rfi2': [('^', '&'), ('9','0')],
    'rfi3': [('*'), ('2')],
    'rfi4': [('('), ('4')],
    'rfi5': [(')', '_', '+'),
             ('6', '8', '#')]
        }

keylout_dd = {
    'lfi5': [('ё', '1', 'й', 'ф', 'я'),
             ('$', '%', 'б', 'ч', 'ш')],
    'lfi4': [('2', 'ц', 'ы', 'ч'), ('[', 'ы', 'и', 'х')],
    'lfi3': [('3', 'у', 'в', 'с'), ('{', 'о', 'е', 'й')],
    'lfi2': [('4', 'к', 'а', 'м', '5', 'е', 'п', 'и'),
             ('}', '(', 'у', 'а', 'к', 'ь', ',', '_')],
    'lfi1': [(' '), (' ')],
    'rfi2': [('6', 'н', 'р', 'т', '7', 'г', 'о', 'ь'),
             ('=', 'ё', '.', '/', '*', '^', 'н', 'р')],
    'rfi3': [('8', 'ш', 'л', 'б'), (')', 'д', 'т', 'м')],
    'rfi4': [('9', 'щ', 'д', 'ю'), ('+', 'я', 'с', 'ф')],
    'rfi5': [('0', 'з', 'ж', '?', '-', 'х', 'э', '=', 'ъ', '\\'),
             (']', 'г', 'в', 'п', '!', 'ж', 'з', 'щ', 'ц', 'ъ')]
    }
