"""
Создает словари раскладок клавиатуры с символами для разных комбинаций клавиш.
Функция возвращает два словаря раскладок:
1. keylout_jcuken - словарь для ицукена
2. keylout_vizov - словарь для вызова
3. keylout_jcuken_shift и keylout_vizov_shift - словари для ицукена и вызова + shift

Ключи словарей соответствуют пальцам рук:
- 'lfi5' обозначает левый мизинец, 'lfi4' - левый безымянный, и так далее.
- 'rfi5' - правый мизинец, 'rfi4' - правый безымянный и т.д.
"""

keylout_jcuken = {
    'lfi5': ('ё', '1', 'й', 'ф', 'я'),
    'lfi4': ('2', 'ц', 'ы', 'ч'),
    'lfi3': ('3', 'у', 'в', 'с'),
    'lfi2': ('4', 'к', 'а', 'м', '5', 'е', 'п', 'и'),
    'lfi1': (' '),
    'rfi2': ('6', 'н', 'р', 'т', '7', 'г', 'о', 'ь'),
    'rfi3': ('8', 'ш', 'л', 'б'),
    'rfi4': ('9', 'щ', 'д', 'ю'),
    'rfi5': ('0', 'з', 'ж', '?', '-', 'х', 'э', '=', 'ъ', '\\')
}

keylout_jcuken_shift = {
    'lfi5': ('~', '!'),
    'lfi4': ('@'),
    'lfi3': ('#'),
    'lfi2': ('$', '%'),
    'rfi2': ('^', '&'),
    'rfi3': ('*'),
    'rfi4': ('('),
    'rfi5': (')', '_', '+')
}

keylout_vizov = {
    'lfi5': ('$', '%', 'б', 'ч', 'ш'),
    'lfi4': ('[', 'ы', 'и', 'х'),
    'lfi3': ('{', 'о', 'е'),
    'lfi2': ('}', '(', 'у', 'а', 'ь', ','),
    'lfi1': (' ', '_', 'к', 'й'),
    'rfi2': ('=', 'ё', '.', '/', '*', '^', 'н', 'р'),
    'rfi3': (')', 'д', 'т', 'м'),
    'rfi4': ('+', 'я', 'с', 'ф'),
    'rfi5': (']', 'г', 'в', 'п', '!', 'ж', 'з', 'щ', 'ц', 'ъ')
}

keylout_vizov_shift = {
    'lfi5': ('$','%'),
    'lfi4': ('7'),
    'lfi3': ('5'),
    'lfi2': ('3','1'),
    'rfi2': ('9','0'),
    'rfi3': ('2'),
    'rfi4': ('4'),
    'rfi5': ('6', '8', '#')
}