"""
Создает словари раскладок клавиатуры с символами для разных комбинаций клавиш.

Функция возвращает несколько словарей раскладок:
1. **keylout_jcuken** — стандартная русская раскладка (ицукен).
2. **keylout_jcuken_shift** — русская раскладка с зажатым Shift.
3. **keylout_vizov** — раскладка "вызов".
4. **keylout_vizov_shift** — раскладка "вызов" с зажатым Shift.
5. **layout_zubachev** — альтернативная раскладка "Зубачев".
6. **layout_zubachev_shift** — "Зубачев" с зажатым Shift.
7. **keylout_diktor** — раскладка "диктор".
8. **keylout_diktor_shift** — "диктор" с зажатым Shift.

Ключи словарей представляют собой обозначения пальцев рук:
- **Левая рука:**
  - 'lfi5' — левый мизинец.
  - 'lfi4' — левый безымянный.
  - 'lfi3' — левый средний.
  - 'lfi2' — левый указательный.
  - 'lfi1' — левый большой (обычно для пробела).

- **Правая рука:**
  - 'rfi5' — правый мизинец.
  - 'rfi4' — правый безымянный.
  - 'rfi3' — правый средний.
  - 'rfi2' — правый указательный.
  - 'rfi1' — правый большой (обычно для пробела).

Каждый ключ содержит кортеж или множество символов, которые могут быть набраны соответствующим пальцем.
"""


keylout_jcuken = {
    'lfi5': ('ё', '1', 'й', 'ф', 'я'),
    'lfi4': ('2', 'ц', 'ы', 'ч'),
    'lfi3': ('3', 'у', 'в', 'с'),
    'lfi2': ('4', 'к', 'а', 'м', '5', 'е', 'п', 'и'),
    'lfi1': (' '),
    'rfi2': ('6', 'н', 'р', 'т', '7', 'г', 'о', 'ь'),
    'rfi3': ('8', 'ш', 'л', 'б'),
    'rfi4': ('9', 'щ', 'д', 'ю'),
    'rfi5': ('0', 'з', 'ж', '?', '-', 'х', 'э', '=', 'ъ', '\\')
}

keylout_jcuken_shift = {
    'lfi5': ('~', '!'),
    'lfi4': ('@'),
    'lfi3': ('#'),
    'lfi2': ('$', '%'),
    'rfi2': ('^', '&'),
    'rfi3': ('*'),
    'rfi4': ('('),
    'rfi5': (')', '_', '+')
}

keylout_vizov = {
    'lfi5': ('$', '%', 'б', 'ч', 'ш'),
    'lfi4': ('[', 'ы', 'и', 'х'),
    'lfi3': ('{', 'о', 'е'),
    'lfi2': ('}', '(', 'у', 'а', 'ь', ','),
    'lfi1': (' ', '_', 'к', 'й'),
    'rfi2': ('=', 'ё', '.', '/', '*', '^', 'н', 'р'),
    'rfi3': (')', 'д', 'т', 'м'),
    'rfi4': ('+', 'я', 'с', 'ф'),
    'rfi5': (']', 'г', 'в', 'п', '!', 'ж', 'з', 'щ', 'ц', 'ъ')
}

keylout_vizov_shift = {
    'lfi5': ('$','%'),
    'lfi4': ('7'),
    'lfi3': ('5'),
    'lfi2': ('3','1'),
    'rfi2': ('9','0'),
    'rfi3': ('2'),
    'rfi4': ('4'),
    'rfi5': ('6', '8', '#')
}

#Клавиатуры других команд

layout_zubachev = {
    'lfi5': {'ё', '1', 'ф', 'г', 'ш'},
    'lfi4': {'2', 'ы', 'и', 'ь', 'ъ'},
    'lfi3': {'3', 'а', 'е', 'ю'},
    'lfi2': {'4', '5', 'я', ',', 'о', 'у', '.', 'э'},
    'lfi1': {' '},
    'rfi2': {'6', '7', 'й', 'м', 'л', 'т', 'б', 'д'},
    'rfi3': {'8', 'р', 'с', 'в'},
    'rfi4': {'9', 'п', 'н', 'к'},
    'rfi5': {'0', '-', '=', 'х', 'ц', 'щ', '/', 'з', 'ж', 'ч'}
}

layout_zubachev_shift = {
    'lfi5': {'!'},
    'lfi4': {'"'},
    'lfi3': {'№'},
    'lfi2': {';', '%', 'ъ', 'ь'},
    'rfi2': {':', '?'},
    'rfi3': {'*'},
    'rfi4': {'('},
    'rfi5': {')', '_', '+'}
}

keylout_diktor = {
    'lfi5': ('ё', '1', 'ц', 'у', 'ф'),
    'lfi4': ('2', 'ь', 'и', 'э'),
    'lfi3': ('3', 'я', 'э', 'х'),
    'lfi2': ('4', ',', 'о', 'ы', '5', '.', 'а', 'ю'),
    'lfi1': (' '),
    'rfi2': ('6', 'з', 'л', 'б', '7', 'в', 'н', 'п'),
    'rfi3': ('8', 'к', 'т', 'п'),
    'rfi4': ('9', 'д', 'с', 'г'),
    'rfi5': ('0', 'ч', 'р', 'ж', '*', 'ш', 'й', '=', 'щ')
}

keylout_diktor_shift = {
    'lfi5': ('ъ'),
    'lfi4': ('ь'),
    'lfi3': ('№'),
    'lfi2': ('%',':'),
    'rfi2': (';','-'),
    'rfi3': ('"'),
    'rfi4': ('('),
    'rfi5': (')','_','+')
}
